class LocationService {
  static const Map<String, Map<String, int>> locationCoordinates = {
    // 서울
    '서울 종로구': {'nx': 60, 'ny': 127},
    '서울 중구': {'nx': 60, 'ny': 127},
    '서울 용산구': {'nx': 60, 'ny': 126},
    '서울 성동구': {'nx': 61, 'ny': 127},
    '서울 광진구': {'nx': 62, 'ny': 126},
    '서울 동대문구': {'nx': 61, 'ny': 127},
    '서울 중랑구': {'nx': 62, 'ny': 128},
    '서울 성북구': {'nx': 61, 'ny': 127},
    '서울 강북구': {'nx': 61, 'ny': 128},
    '서울 도봉구': {'nx': 61, 'ny': 129},
    '서울 노원구': {'nx': 61, 'ny': 129},
    '서울 은평구': {'nx': 59, 'ny': 127},
    '서울 서대문구': {'nx': 59, 'ny': 127},
    '서울 마포구': {'nx': 59, 'ny': 127},
    '서울 양천구': {'nx': 58, 'ny': 126},
    '서울 강서구': {'nx': 58, 'ny': 126},
    '서울 구로구': {'nx': 58, 'ny': 125},
    '서울 금천구': {'nx': 59, 'ny': 124},
    '서울 영등포구': {'nx': 58, 'ny': 126},
    '서울 동작구': {'nx': 59, 'ny': 125},
    '서울 관악구': {'nx': 59, 'ny': 125},
    '서울 서초구': {'nx': 61, 'ny': 125},
    '서울 강남구': {'nx': 61, 'ny': 126},
    '서울 송파구': {'nx': 62, 'ny': 126},
    '서울 강동구': {'nx': 62, 'ny': 126},
    
    // 부산
    '부산 중구': {'nx': 97, 'ny': 74},
    '부산 서구': {'nx': 97, 'ny': 74},
    '부산 동구': {'nx': 98, 'ny': 75},
    '부산 영도구': {'nx': 98, 'ny': 74},
    '부산 부산진구': {'nx': 97, 'ny': 75},
    '부산 동래구': {'nx': 98, 'ny': 76},
    '부산 남구': {'nx': 98, 'ny': 75},
    '부산 북구': {'nx': 96, 'ny': 76},
    '부산 해운대구': {'nx': 99, 'ny': 75},
    '부산 사하구': {'nx': 96, 'ny': 74},
    '부산 금정구': {'nx': 98, 'ny': 77},
    '부산 강서구': {'nx': 96, 'ny': 76},
    '부산 연제구': {'nx': 98, 'ny': 76},
    '부산 수영구': {'nx': 99, 'ny': 75},
    '부산 사상구': {'nx': 96, 'ny': 75},
    '부산 기장군': {'nx': 100, 'ny': 77},
    
    // 대구
    '대구 중구': {'nx': 89, 'ny': 90},
    '대구 동구': {'nx': 90, 'ny': 91},
    '대구 서구': {'nx': 88, 'ny': 90},
    '대구 남구': {'nx': 89, 'ny': 90},
    '대구 북구': {'nx': 89, 'ny': 91},
    '대구 수성구': {'nx': 89, 'ny': 90},
    '대구 달서구': {'nx': 88, 'ny': 90},
    '대구 달성군': {'nx': 86, 'ny': 88},
    
    // 인천
    '인천 중구': {'nx': 54, 'ny': 125},
    '인천 동구': {'nx': 54, 'ny': 125},
    '인천 미추홀구': {'nx': 54, 'ny': 124},
    '인천 연수구': {'nx': 55, 'ny': 123},
    '인천 남동구': {'nx': 56, 'ny': 124},
    '인천 부평구': {'nx': 55, 'ny': 125},
    '인천 계양구': {'nx': 56, 'ny': 126},
    '인천 서구': {'nx': 55, 'ny': 126},
    '인천 강화군': {'nx': 51, 'ny': 130},
    '인천 옹진군': {'nx': 54, 'ny': 124},
    
    // 광주(전라도)
    '광주 동구': {'nx': 60, 'ny': 74},
    '광주 서구': {'nx': 59, 'ny': 74},
    '광주 남구': {'nx': 59, 'ny': 73},
    '광주 북구': {'nx': 59, 'ny': 75},
    '광주 광산구': {'nx': 57, 'ny': 74},
    
    // 대전
    '대전 동구': {'nx': 68, 'ny': 100},
    '대전 중구': {'nx': 68, 'ny': 100},
    '대전 서구': {'nx': 67, 'ny': 100},
    '대전 유성구': {'nx': 67, 'ny': 101},
    '대전 대덕구': {'nx': 68, 'ny': 100},
    
    // 울산
    '울산 중구': {'nx': 102, 'ny': 84},
    '울산 남구': {'nx': 102, 'ny': 84},
    '울산 동구': {'nx': 104, 'ny': 83},
    '울산 북구': {'nx': 103, 'ny': 85},
    '울산 울주군': {'nx': 101, 'ny': 84},
    
    // 세종
    '세종': {'nx': 66, 'ny': 103},
    
    // 경기
    '수원 장안구': {'nx': 60, 'ny': 121},
    '수원 권선구': {'nx': 60, 'ny': 120},
    '수원 팔달구': {'nx': 61, 'ny': 121},
    '수원 영통구': {'nx': 61, 'ny': 120},
    '성남 수정구': {'nx': 62, 'ny': 123},
    '성남 중원구': {'nx': 63, 'ny': 124},
    '성남 분당구': {'nx': 62, 'ny': 123},
    '의정부': {'nx': 61, 'ny': 130},
    '안양 만안구': {'nx': 59, 'ny': 123},
    '안양 동안구': {'nx': 59, 'ny': 123},
    '부천': {'nx': 56, 'ny': 125},
    '광명': {'nx': 58, 'ny': 125},
    '평택': {'nx': 62, 'ny': 114},
    '동두천': {'nx': 61, 'ny': 134},
    '안산 상록구': {'nx': 58, 'ny': 121},
    '안산 단원구': {'nx': 57, 'ny': 121},
    '고양 덕양구': {'nx': 57, 'ny': 128},
    '고양 일산동구': {'nx': 56, 'ny': 129},
    '고양 일산서구': {'nx': 56, 'ny': 129},
    '과천': {'nx': 60, 'ny': 124},
    '구리': {'nx': 62, 'ny': 127},
    '남양주': {'nx': 64, 'ny': 128},
    '오산': {'nx': 62, 'ny': 118},
    '시흥': {'nx': 57, 'ny': 123},
    '군포': {'nx': 59, 'ny': 122},
    '의왕': {'nx': 60, 'ny': 122},
    '하남': {'nx': 62, 'ny': 126},
    '용인 처인구': {'nx': 64, 'ny': 119},
    '용인 기흥구': {'nx': 62, 'ny': 120},
    '용인 수지구': {'nx': 62, 'ny': 121},
    '파주': {'nx': 56, 'ny': 131},
    '이천': {'nx': 68, 'ny': 121},
    '안성': {'nx': 65, 'ny': 115},
    '김포': {'nx': 55, 'ny': 128},
    '화성': {'nx': 57, 'ny': 119},
    '광주(경기도)': {'nx': 65, 'ny': 123},
    '양주': {'nx': 61, 'ny': 131},
    '포천': {'nx': 64, 'ny': 134},
    '여주': {'nx': 71, 'ny': 121},
    '연천군': {'nx': 61, 'ny': 138},
    '가평군': {'nx': 69, 'ny': 133},
    '양평군': {'nx': 69, 'ny': 125},
    
    // 강원
    '춘천': {'nx': 73, 'ny': 134},
    '원주': {'nx': 76, 'ny': 122},
    '강릉': {'nx': 92, 'ny': 131},
    '동해': {'nx': 97, 'ny': 127},
    '태백': {'nx': 95, 'ny': 119},
    '속초': {'nx': 87, 'ny': 141},
    '삼척': {'nx': 98, 'ny': 125},
    '홍천군': {'nx': 75, 'ny': 131},
    '횡성군': {'nx': 77, 'ny': 125},
    '영월군': {'nx': 86, 'ny': 119},
    '평창군': {'nx': 84, 'ny': 123},
    '정선군': {'nx': 89, 'ny': 123},
    '철원군': {'nx': 65, 'ny': 139},
    '화천군': {'nx': 72, 'ny': 139},
    '양구군': {'nx': 77, 'ny': 139},
    '인제군': {'nx': 80, 'ny': 138},
    '고성군(강원)': {'nx': 85, 'ny': 145},
    '양양군': {'nx': 88, 'ny': 138},
    
    // 충북
    '청주 상당구': {'nx': 69, 'ny': 106},
    '청주 서원구': {'nx': 69, 'ny': 107},
    '청주 흥덕구': {'nx': 67, 'ny': 106},
    '청주 청원구': {'nx': 69, 'ny': 107},
    '충주': {'nx': 76, 'ny': 114},
    '제천': {'nx': 81, 'ny': 118},
    '보은군': {'nx': 73, 'ny': 103},
    '옥천군': {'nx': 71, 'ny': 99},
    '영동군': {'nx': 74, 'ny': 95},
    '증평군': {'nx': 71, 'ny': 110},
    '진천군': {'nx': 68, 'ny': 111},
    '괴산군': {'nx': 74, 'ny': 111},
    '음성군': {'nx': 72, 'ny': 113},
    '단양군': {'nx': 84, 'ny': 115},
    
    // 충남
    '천안 동남구': {'nx': 63, 'ny': 112},
    '천안 서북구': {'nx': 63, 'ny': 112},
    '공주': {'nx': 60, 'ny': 99},
    '보령': {'nx': 54, 'ny': 100},
    '아산': {'nx': 60, 'ny': 110},
    '서산': {'nx': 51, 'ny': 110},
    '논산': {'nx': 62, 'ny': 97},
    '계룡': {'nx': 65, 'ny': 99},
    '당진': {'nx': 54, 'ny': 112},
    '금산군': {'nx': 69, 'ny': 95},
    '부여군': {'nx': 59, 'ny': 99},
    '서천군': {'nx': 55, 'ny': 94},
    '청양군': {'nx': 57, 'ny': 103},
    '홍성군': {'nx': 55, 'ny': 106},
    '예산군': {'nx': 58, 'ny': 107},
    '태안군': {'nx': 48, 'ny': 109},
    
    // 전북
    '전주 완산구': {'nx': 63, 'ny': 89},
    '전주 덕진구': {'nx': 63, 'ny': 89},
    '군산': {'nx': 56, 'ny': 92},
    '익산': {'nx': 60, 'ny': 91},
    '정읍': {'nx': 58, 'ny': 83},
    '남원': {'nx': 68, 'ny': 80},
    '김제': {'nx': 59, 'ny': 88},
    '완주군': {'nx': 63, 'ny': 89},
    '진안군': {'nx': 68, 'ny': 88},
    '무주군': {'nx': 72, 'ny': 93},
    '장수군': {'nx': 70, 'ny': 85},
    '임실군': {'nx': 66, 'ny': 84},
    '순창군': {'nx': 63, 'ny': 79},
    '고창군': {'nx': 56, 'ny': 85},
    '부안군': {'nx': 56, 'ny': 87},
    
    // 전남
    '목포': {'nx': 50, 'ny': 67},
    '여수': {'nx': 73, 'ny': 66},
    '순천': {'nx': 70, 'ny': 70},
    '나주': {'nx': 56, 'ny': 71},
    '광양': {'nx': 73, 'ny': 70},
    '담양군': {'nx': 61, 'ny': 78},
    '곡성군': {'nx': 66, 'ny': 77},
    '구례군': {'nx': 69, 'ny': 75},
    '고흥군': {'nx': 66, 'ny': 62},
    '보성군': {'nx': 62, 'ny': 66},
    '화순군': {'nx': 61, 'ny': 72},
    '장흥군': {'nx': 59, 'ny': 64},
    '강진군': {'nx': 57, 'ny': 63},
    '해남군': {'nx': 54, 'ny': 61},
    '영암군': {'nx': 56, 'ny': 66},
    '무안군': {'nx': 52, 'ny': 71},
    '함평군': {'nx': 56, 'ny': 72},
    '영광군': {'nx': 52, 'ny': 77},
    '장성군': {'nx': 57, 'ny': 77},
    '완도군': {'nx': 57, 'ny': 56},
    '진도군': {'nx': 48, 'ny': 59},
    '신안군': {'nx': 50, 'ny': 66},
    
    // 경북
    '포항 남구': {'nx': 102, 'ny': 94},
    '포항 북구': {'nx': 102, 'ny': 95},
    '경주': {'nx': 100, 'ny': 91},
    '김천': {'nx': 80, 'ny': 96},
    '안동': {'nx': 91, 'ny': 106},
    '구미': {'nx': 84, 'ny': 96},
    '영주': {'nx': 89, 'ny': 111},
    '영천': {'nx': 95, 'ny': 93},
    '상주': {'nx': 81, 'ny': 102},
    '문경': {'nx': 81, 'ny': 106},
    '경산': {'nx': 91, 'ny': 90},
    '군위군': {'nx': 88, 'ny': 99},
    '의성군': {'nx': 90, 'ny': 101},
    '청송군': {'nx': 96, 'ny': 103},
    '영양군': {'nx': 97, 'ny': 108},
    '영덕군': {'nx': 102, 'ny': 103},
    '청도군': {'nx': 91, 'ny': 86},
    '고령군': {'nx': 83, 'ny': 87},
    '성주군': {'nx': 83, 'ny': 91},
    '칠곡군': {'nx': 85, 'ny': 93},
    '예천군': {'nx': 86, 'ny': 107},
    '봉화군': {'nx': 90, 'ny': 113},
    '울진군': {'nx': 102, 'ny': 115},
    '울릉군': {'nx': 127, 'ny': 127},
    
    // 경남
    '창원 의창구': {'nx': 90, 'ny': 77},
    '창원 성산구': {'nx': 91, 'ny': 76},
    '창원 마산합포구': {'nx': 89, 'ny': 76},
    '창원 마산회원구': {'nx': 89, 'ny': 76},
    '창원 진해구': {'nx': 91, 'ny': 77},
    '진주': {'nx': 90, 'ny': 75},
    '통영': {'nx': 87, 'ny': 68},
    '사천': {'nx': 80, 'ny': 71},
    '김해': {'nx': 95, 'ny': 77},
    '밀양': {'nx': 92, 'ny': 83},
    '거제': {'nx': 90, 'ny': 69},
    '양산': {'nx': 97, 'ny': 79},
    '의령군': {'nx': 83, 'ny': 78},
    '함안군': {'nx': 86, 'ny': 77},
    '창녕군': {'nx': 87, 'ny': 83},
    '고성군(경남)': {'nx': 85, 'ny': 71},
    '남해군': {'nx': 77, 'ny': 68},
    '하동군': {'nx': 74, 'ny': 73},
    '산청군': {'nx': 76, 'ny': 80},
    '함양군': {'nx': 74, 'ny': 82},
    '거창군': {'nx': 77, 'ny': 86},
    '합천군': {'nx': 81, 'ny': 84},
    
    // 제주
    '제주': {'nx': 52, 'ny': 38},
    '서귀포': {'nx': 52, 'ny': 33},
  };

  static Map<String, int>? getCoordinates(String location) {
    return locationCoordinates[location];
  }

  static List<String> getAllLocations() {
    return locationCoordinates.keys.toList()..sort();
  }

  static Map<String, List<String>> getGroupedLocations() {
    Map<String, List<String>> grouped = {};
    
    for (String location in locationCoordinates.keys) {
      String region = location.split(' ')[0]; // 첫 단어가 광역시/도 이름
      
      if (!grouped.containsKey(region)) {
        grouped[region] = [];
      }
      grouped[region]!.add(location);
    }
    
    // 각 그룹 내 정렬
    grouped.forEach((key, value) {
      value.sort();
    });
    
    return grouped;
  }

  static List<String> searchLocations(String query) {
    if (query.isEmpty) return getAllLocations();
    
    return locationCoordinates.keys
        .where((location) => location.contains(query))
        .toList()
      ..sort();
  }
}